import { POST } from "./constants.js";
export const products = [
  {
    name: "Смартфон Samsung Galaxy Z Fold4 512 ГБ бежевый",
    image: `http://localhost:${POST}/static/images/phone.png`,
    price: 80599,
    id: 1,
    discription: `Смартфон сочетает в себе два умных устройства одновременно. По сути, это и компьютер, и смартфон в одном устройстве. Смартфон обладает небольшими габаритами, удобно лежит в кармане или сумке и при этом имеет большой экран с минимальными рамками, который позволяет вам наслаждаться привычным контентом и выполнять ежедневные задачи.`,
  },

  {
    name: "Экшн-камера GoPro HERO 11 Black Edition черный",
    image: `http://localhost:${POST}/static/images/camera.png`,
    price: 14699,
    id: 2,
    discription: `HERO11 Black — самая универсальная камера в мире.
    Видеоролики с лучшими моментами отправляются на телефон с камеры HERO11 Black автоматически. Благодаря ее новой увеличенной матрице, которая обеспечивает больший охват кадра и более высокое качество изображения, вы можете мгновенно публиковать вертикальные снимки в социальных сетях. HyperSmooth 5.0 с функциями автоповышения и блокировки горизонта обеспечивает невероятную плавность и потрясающее качество кадров. Новые эффекты для ночной съемки позволят вам творить после наступления темноты, а 10-битный цвет обеспечит реалистичную цветопередачу в ваших видеороликах. Все эти и другие возможности делают HERO11 Black самой функциональной из существующих камер GoPro.`,
  },
  {
    name: '17.3" Ноутбук MSI GT77 Titan 12UHS-066RU черный',
    image: `http://localhost:${POST}/static/images/notebook.jpg`,
    price: 110499,
    id: 3,
    discription: `Экстремальная производительность, инновационные технологии и роскошный дизайн – ноутбук Titan GT77 представляет собой вершину игровых технологий. В его высокопроизводительную конфигурацию могут входить новейший процессор Intel® Core™ i9-12900HX 12-го поколения и видеокарта NVIDIA® GeForce RTX™ 30-й серии, а в его стильном облике яркой деталью выступает иллюминация Mystic Light. Ноутбук Titan GT77 – возрождение легенды!`,
  },
  {
    name: "Дрель-шуруповерт DeWalt XRP DCD996P2 XR18V",
    image: `http://localhost:${POST}/static/images/shurik.jpg`,
    price: 8750,
    id: 4,
    discription: `Дрель ударная DEWALT DCD996P2-QW 18.0в xr бесщет. двиг. удар xrp 650Вт 0-450/1300/2000об./мин Самая мощная бесщёточная ударная дрель/шуруповёрт DEWALT в линейке 18В XR Li-Ion XRPНовая высокомощная дрель - шуруповёрт с увеличенной производительностью сверления в камне/ Новый 3-х позиционный включатель LED подстветки рабочей области с функцией фонаря на 20 минут. Бесшумный 3-х скоростной редуктор обеспечивает лучшую производительность и долгий срок службы инструмента11-позиционный регулятор крутящего момента для работы в различных материалах и с шурупами разного размера.`,
  },
  {
    name: "Вытяжка каминная Kaiser AT 6433 Eco серебристый/черный",
    image: `http://localhost:${POST}/static/images/viteshka.jpg`,
    price: 7300,
    id: 5,
    discription: `Не всегда возможно подключить вытяжной шкаф к вентиляционной системе. В этом случае вытяжные шкафы Kaiser могут работать как система фильтрации. Металлический жировой фильтр сначала поглощает жирные составляющие и другие крошечные частицы, затем пахучие вещества и микрочастицы направляются через фильтр с активированным углем. Воздух возвращается очищенным на кухню. Вытяжка обеспечивает постоянную подачу воздуха через щели по всему периметру откидной панели. За этой панелью скрыты угольный и / или жировой фильтры. Всасывание по периметру возможно благодаря эффекту Вентури, названному в честь итальянского физика Джованни Вентури, который открыл его. Используемая в выхлопном режиме алюминиевая труба диаметром 150 мм проста в использовании и сборке, может изгибаться по мере необходимости и растягиваться по всей длине, благодаря небольшому весу не требует дополнительной фиксации, также алюминиевые гофрированные трубы имеют долгое время использования.`,
  },
  {
    name: '31.5" Монитор Samsung Odyssey G7 C32G75TQSI черный',
    image: `http://localhost:${POST}/static/images/screen.jpg`,
    price: 15699,
    id: 6,
    discription: `Изогнутость экрана с радиусом кривизны 1000R - это новая вершина технологии производства изогнутых экранов с кривизной, полностью соответствующей кривизне хрусталика глаз человека, обеспечивающей максимальный реализм изображения и комфорт для зрения. QLED, HDR600 и WQHD разрешение для естественной цветопередачи, ощущения глубины и детализации изображения. Тонкий матово-черный корпус гармонирует с фантастически подсвеченной панелью и создает ощущение устройства, пришедшего к нам из будущего. Поддержка частоты 240Гц RapidCurve, время отклика в 1 миллисекунду и совместимость с технологией синхронизации G-Sync обеспечат вам победу в любой игре.`,
  },
];
