let arr = [13, -80, -15, 227, 3];

// ================================================================================

// Метод pop - МУТАБЕЛЬНЫЙ МЕТОД
// arr.pop();
// console.log(arr);

// Реализация метода pop - НЕ МУТАБЕЛЬНЫЙ
// let immut = arr.slice(0, -1);
// console.log("Новый массив без последнего элемента: " + "[" + immut1 + "]");
// console.log("Оригинальный массив: " + "[" + arr + "]");

// ================================================================================

// Метод push- МУТАБЕЛЬНЫЙ МЕТОД
// arr.push(1337);
// console.log(arr);

// Реализация метода push - НЕ МУТАБЕЛЬНЫЙ
// let immut = [...arr, 2556];
// console.log("Оригинальный массив: " + "[" + arr + "]");
// console.log("Новый массив c новым элементом в конце: " + "[" + immut + "]");

// ===============================================================================

// Метод shift - МУТАБЕЛЬНЫЙ МЕТОД
// arr.shift();
// console.log(arr);

// Реализация метода shift - НЕ МУТАБЕЛЬНЫЙ
// let firstItem;
// let immut;
// [firstItem, ...immut] = arr;
// console.log("Оригинальный массив: " + "[" + arr + "]");
// console.log("Новый массив без первого элементом: " + "[" + immut + "]");
// console.log("Первый элемент(оставшееся значение): " + firstItem);

// =================================================================================

// Метод unshift - МУТАБЕЛЬНЫЙ МЕТОД
// arr.unshift(200);
// console.log(arr);

// Реализация метода unshift - НЕ МУТАБЕЛЬНЫЙ
// let immut;
//  immut = [200, ...arr];
// console.log("Оригинальный массив: " + "[" + arr + "]");
// console.log("Новый массив c новым элементом в начале: " + "[" + immut + "]");

// =================================================================================

// Метод reverse - МУТАБЕЛЬНЫЙ МЕТОД
// arr.reverse();
// console.log(arr);

// Реализация метода reverse - НЕ МУТАБЕЛЬНЫЙ
// let immut = [...arr].reverse();
// console.log("Оригинальный массив: " + "[" + arr + "]");
// console.log(
//   "Новый массив c элементами в обратном порядке: " + "[" + immut + "]"
// );
