"use state";

////////////////////FUNCTION DECLARATION///////////////////////
// Объявление функции

console.log(dec());
function dec() {
  return 1340 - 3;
}
console.log(dec());
//Можно вызывать, как до самой функции, так и после

////////////////////FUNCTION EXPRESSION///////////////////////
// Декларативный способ написания функции - ФУНКЦИОНАЛЬНОЕ ВЫРАЖЕНИЕ

let exp = function () {
  return 227 + 1;
};
console.log(exp());
//Нельзя вызывать функциональное выражение, до выделения для него переменной
