export let texts = [
  { id: 1, text: "Фотки с Кадыровым - моя гордость" },
  { id: 2, text: "Лицо попроще и жизнь удалась!" },
  { id: 3, text: "На сердце бардак" },
  { id: 4, text: "Сочинял на бегу!" },
  { id: 5, text: "Все минуты забиты главными делами" },
  { id: 6, text: "Моя бритая бошка - их лысая гора" },
  { id: 7, text: "Последовательность машинальных действий" },
  { id: 8, text: "ЗОЖ в голове" },
  { id: 9, text: "Ещё одна МДМА и края нет!" },
  { id: 10, text: "Сыграй на флейте Юпикола" },
];
